README.org
#+TITLE: Astra Docs and Planning
#+DESCRIPTION: Astra is a mission control framework for KSP to facilitate fully automated missions and operations. Also hoping to learn a bit about control theory in the process.
#+AUTHOR: Tyler Weldon
#+EMAIL: tylerweldon94@gmail.com

* Astra
** TODO Stage 1 - Prep [0/6]
  - [ ] Kubernetes Deployment [0/9]
    - [ ] Mod install [0/6]
      - [ ] [[https://forum.kerbalspaceprogram.com/index.php?/topic/193933-110-kks-spacex-pack-july-06-2020/][KK's SpaceX Pack]]
      - [ ] RO via CKAN
      - [ ] Principia
      - [ ] Install CKAN.deb
      - [ ] kRPC manually from github
      - [ ] AutoLoadGame - Allista
    - [ ] astra-base.sfs
    - [ ] AutoLoadGame.conf
    - [ ] settings.cfg
    - [ ] krpc-settings.cfg
    - [ ] AutoLoadGame - Now supports specifying SFS files
    - [ ] POC kRPC - connection over Internet successful, responses receieved
    - [ ] Install KSP +1.7.3+ 1.8.1 from S3
    - [ ] File provision packer/files/*
  - [ ] Automate game-archiver
  - [ ] Choose kRPC client language - C++/Python
  - [ ] Xpra/xpra attach workflow for graphical debugging and SFS building
  - [ ] Debug RO Install, problems w/ Kopernicus?
** TODO Stage 2 - Data(and Project Automation) [0/1]
- [ ] Python classes [0/4]
  - [ ] CraftTransmitter
  - [ ] CraftReciever
  - [ ] StationTransmitter
  - [ ] StationReceiver
** TODO Stage 3 - RL Software integrations [0/2]
- [ ] [[https://opensource.gsfc.nasa.gov/projects/GMAT/index.php][GMAT]] - Planning
- [ ] [[https://github.com/nasa/openmct][OpenMCT]] - Ops HUD
** TODO Stage 4 - Operations [0/3]
*** [-] For re-usable missions: [0/1]
**** [ ] Will need something like [[https://forum.kerbalspaceprogram.com/index.php?/topic/157214-19x-flight-manager-for-reusable-stages-fmrs-now-with-recoverycontroller-integration/][FMRS]] implemented via kRPC
*** [-] Starlink(s) [0/0]
*** [-] Long running, real time ops [0/0]
** TODO Stage 5 - Stream Real Time Ops [0/0]
** TODO Backlog/As Needed [0/2]
  - [ ] If TCP latency becomes a problem, try implementing a kRPC unix socket comm. protocol
    * +There are module load errors in KSP.log, not sure if its preventing AutoLoadGame from doing its thing, or if that is related to the Changelog startup dialog in KSP Main Menu.+ KSP 1.8.1 Works great
    * +Why are we stuck at the Change Log dialog on KSP Start?+ A bit annoying but appears to be inconsequential for my automation purposes.
      * ksp settings.cfg:
        * SHOW_WHATSNEW_DIALOG = False
        * +Version 1.7.3 was not honoring settings.cfg, lets see if 1.8.1 works+ Still not honored in 1.8.1 but again, appears inconsequential
** KSP Mod Requirements
- [[https://github.com/allista/AutoLoadGame][AutoLoadGame]] - by Allista, allows creating a configuration file in your saves dir that will automatically load the specified sfs file upong game start.
- [[https://krpc.github.io/krpc/][kRPC]] - kRPC allows you to control Kerbal Space Program from scripts running outside of the game.
- [[https://github.com/KSP-RO/RealismOverhaul/wiki][Realism Overhaul]] - Its not certain this will place nice with [[https://krpc.github.io/krpc/][kRPC]], however realistic(ish?) control theory is really the purpose of this project so we will proceed with it until/unless we encounter problems.
- [[https://ksp-kos.github.io/KOS/][kOS]] - kOS might be useful for some simpler tasks where we don't want the full power of kRPC. Might use, might not. We'll see.
