README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-04 Sun 22:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Astra Docs and Planning</title>
<meta name="author" content="Tyler Weldon" />
<meta name="description" content="Astra is a mission control framework for KSP to facilitate fully automated missions and operations. Also hoping to learn a bit about control theory in the process." />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Astra Docs and Planning</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb3cc1ef">1. Astra</a>
<ul>
<li><a href="#orgfda7af5">1.1. <span class="todo TODO">TODO</span> Stage 1 - Prep <code>[0/5]</code></a></li>
<li><a href="#orgcfd6e10">1.2. <span class="todo TODO">TODO</span> Stage 2 - Data(and Project Automation) <code>[0/1]</code></a></li>
<li><a href="#org4145636">1.3. <span class="todo TODO">TODO</span> Stage 3 - RL Software integrations <code>[0/2]</code></a></li>
<li><a href="#org0095663">1.4. <span class="todo TODO">TODO</span> Stage 4 - Operations <code>[0/3]</code></a>
<ul>
<li><a href="#org4da4656">1.4.1. <span class="todo ___">[-]</span> For re-usable missions: <code>[0/1]</code></a></li>
<li><a href="#org9c2b7d9">1.4.2. <span class="todo ___">[-]</span> Starlink(s) <code>[0/0]</code></a></li>
<li><a href="#org4b7e3d7">1.4.3. <span class="todo ___">[-]</span> Long running, real time ops <code>[0/0]</code></a></li>
</ul>
</li>
<li><a href="#orge17fd68">1.5. <span class="todo TODO">TODO</span> Stage 5 - Stream Real Time Ops <code>[0/0]</code></a></li>
<li><a href="#org403ebd9">1.6. <span class="todo TODO">TODO</span> Backlog/As Needed <code>[0/2]</code></a></li>
<li><a href="#org67c1902">1.7. KSP Mod Requirements</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb3cc1ef" class="outline-2">
<h2 id="orgb3cc1ef"><span class="section-number-2">1.</span> Astra</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgfda7af5" class="outline-3">
<h3 id="orgfda7af5"><span class="section-number-3">1.1.</span> <span class="todo TODO">TODO</span> Stage 1 - Prep <code>[0/5]</code></h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Kubernetes Deployment <code>[0/10]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Game start script <code>[0/3]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> sshd <code>[0/3]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> allow root</li>
<li class="off"><code>[&#xa0;]</code> public key only</li>
<li class="off"><code>[&#xa0;]</code> allow X11 forwarding</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> xpra</li>
<li class="off"><code>[&#xa0;]</code> ksp on xpra display</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Mod install <code>[0/6]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <a href="https://forum.kerbalspaceprogram.com/index.php?/topic/193933-110-kks-spacex-pack-july-06-2020/">KK&rsquo;s SpaceX Pack</a></li>
<li class="off"><code>[&#xa0;]</code> RO via CKAN</li>
<li class="off"><code>[&#xa0;]</code> Principia</li>
<li class="off"><code>[&#xa0;]</code> Install CKAN.deb</li>
<li class="off"><code>[&#xa0;]</code> kRPC manually from github</li>
<li class="off"><code>[&#xa0;]</code> AutoLoadGame - Allista</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> astra-base.sfs</li>
<li class="off"><code>[&#xa0;]</code> AutoLoadGame.conf</li>
<li class="off"><code>[&#xa0;]</code> settings.cfg</li>
<li class="off"><code>[&#xa0;]</code> krpc-settings.cfg</li>
<li class="off"><code>[&#xa0;]</code> AutoLoadGame - Now supports specifying SFS files</li>
<li class="off"><code>[&#xa0;]</code> POC kRPC - connection over Internet successful, responses receieved</li>
<li class="off"><code>[&#xa0;]</code> Install KSP <del>1.7.3</del> 1.8.1 from S3</li>
<li class="off"><code>[&#xa0;]</code> File provision packer/files/*</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> Automate game-archiver</li>
<li class="off"><code>[&#xa0;]</code> Choose kRPC client language - C++/Python</li>
<li class="off"><code>[&#xa0;]</code> Xpra/xpra attach workflow for graphical debugging and SFS building</li>
<li class="off"><code>[&#xa0;]</code> Debug RO Install, problems w/ Kopernicus?</li>
</ul>
</div>
</div>
<div id="outline-container-orgcfd6e10" class="outline-3">
<h3 id="orgcfd6e10"><span class="section-number-3">1.2.</span> <span class="todo TODO">TODO</span> Stage 2 - Data(and Project Automation) <code>[0/1]</code></h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Python classes <code>[0/4]</code>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> CraftTransmitter</li>
<li class="off"><code>[&#xa0;]</code> CraftReciever</li>
<li class="off"><code>[&#xa0;]</code> StationTransmitter</li>
<li class="off"><code>[&#xa0;]</code> StationReceiver</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4145636" class="outline-3">
<h3 id="org4145636"><span class="section-number-3">1.3.</span> <span class="todo TODO">TODO</span> Stage 3 - RL Software integrations <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <a href="https://opensource.gsfc.nasa.gov/projects/GMAT/index.php">GMAT</a> - Planning</li>
<li class="off"><code>[&#xa0;]</code> <a href="https://github.com/nasa/openmct">OpenMCT</a> - Ops HUD</li>
</ul>
</div>
</div>
<div id="outline-container-org0095663" class="outline-3">
<h3 id="org0095663"><span class="section-number-3">1.4.</span> <span class="todo TODO">TODO</span> Stage 4 - Operations <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-org4da4656" class="outline-4">
<h4 id="org4da4656"><span class="section-number-4">1.4.1.</span> <span class="todo ___">[-]</span> For re-usable missions: <code>[0/1]</code></h4>
<div class="outline-text-4" id="text-1-4-1">
</div>
<ol class="org-ol">
<li><a id="orga259ee6"></a><span class="todo ___">[ ]</span> Will need something like <a href="https://forum.kerbalspaceprogram.com/index.php?/topic/157214-19x-flight-manager-for-reusable-stages-fmrs-now-with-recoverycontroller-integration/">FMRS</a> implemented via kRPC<br /></li>
</ol>
</div>
<div id="outline-container-org9c2b7d9" class="outline-4">
<h4 id="org9c2b7d9"><span class="section-number-4">1.4.2.</span> <span class="todo ___">[-]</span> Starlink(s) <code>[0/0]</code></h4>
</div>
<div id="outline-container-org4b7e3d7" class="outline-4">
<h4 id="org4b7e3d7"><span class="section-number-4">1.4.3.</span> <span class="todo ___">[-]</span> Long running, real time ops <code>[0/0]</code></h4>
</div>
</div>
<div id="outline-container-orge17fd68" class="outline-3">
<h3 id="orge17fd68"><span class="section-number-3">1.5.</span> <span class="todo TODO">TODO</span> Stage 5 - Stream Real Time Ops <code>[0/0]</code></h3>
</div>
<div id="outline-container-org403ebd9" class="outline-3">
<h3 id="org403ebd9"><span class="section-number-3">1.6.</span> <span class="todo TODO">TODO</span> Backlog/As Needed <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> If TCP latency becomes a problem, try implementing a kRPC unix socket comm. protocol
<ul class="org-ul">
<li><del>There are module load errors in KSP.log, not sure if its preventing AutoLoadGame from doing its thing, or if that is related to the Changelog startup dialog in KSP Main Menu.</del> KSP 1.8.1 Works great</li>
<li><del>Why are we stuck at the Change Log dialog on KSP Start?</del> A bit annoying but appears to be inconsequential for my automation purposes.
<ul class="org-ul">
<li>ksp settings.cfg:
<ul class="org-ul">
<li>SHOW<sub>WHATSNEW</sub><sub>DIALOG</sub> = False</li>
<li><del>Version 1.7.3 was not honoring settings.cfg, lets see if 1.8.1 works</del> Still not honored in 1.8.1 but again, appears inconsequential</li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org67c1902" class="outline-3">
<h3 id="org67c1902"><span class="section-number-3">1.7.</span> KSP Mod Requirements</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li><a href="https://github.com/allista/AutoLoadGame">AutoLoadGame</a> - by Allista, allows creating a configuration file in your saves dir that will automatically load the specified sfs file upong game start.</li>
<li><a href="https://krpc.github.io/krpc/">kRPC</a> - kRPC allows you to control Kerbal Space Program from scripts running outside of the game.</li>
<li><a href="https://github.com/KSP-RO/RealismOverhaul/wiki">Realism Overhaul</a> - Its not certain this will place nice with <a href="https://krpc.github.io/krpc/">kRPC</a>, however realistic(ish?) control theory is really the purpose of this project so we will proceed with it until/unless we encounter problems.</li>
<li><a href="https://ksp-kos.github.io/KOS/">kOS</a> - kOS might be useful for some simpler tasks where we don&rsquo;t want the full power of kRPC. Might use, might not. We&rsquo;ll see.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tyler Weldon</p>
<p class="date">Created: 2022-09-04 Sun 22:45</p>
</div>
</body>
</html>
